{
  "services": [
    {
      "id": 1,
      "title": "modern design",
      "description": "Your website will look stunning and function perfectly on any device - desktop, tablet, or mobile. No outdated designs, just sleek, modern, and user-friendly experiences."
    },
    {
      "id": 2,
      "title": "comprehensive",
      "description": "What's the point of a website if no one finds it? We build websites with SEO best practices to help you rank on Google and attract organic traffic."
    },
    {
      "id": 3,
      "title": "support & maintenance",
      "description": "A website needs updates, security checks, and tweaks to stay relevant. We offer post-launch support, troubleshooting, and maintenance so you never have to worry."
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Napparaten",
      "description": "A responsive website for a Stockholm-based naprapathy clinic. Designed to highlight services, build trust and simplify appointment bookings.",
      "img_alt": "Homepage of Napparaten, a Stockholm naprapathy clinic, with clean layout, calming visuals and a prominent call-to-action to book an appointment",
      "img_src": "napparaten.png",
      "external_link": "https://napparaten.se/"
    },
    {
      "id": 2,
      "title": "Jon Raynor PT",
      "description": "A modern site for a personal trainer, built to showcase training programs and client results. Focused on clarity, motivation and conversion.",
      "img_alt": "Homepage of personal trainer Jon Raynor, featuring bold fitness imagery, a motivational headline and links to training services.",
      "img_src": "pt_jonraynor.png",
      "external_link": "https://rylandermedia.wixstudio.com/ptjonraynor"
    }
  ],
  "testimonials": [
    {
      "id": 1,
      "name": "Daniel Yeoh",
      "title": "naprapath",
      "testimonial": "I hired Joe to build my website and was very satisfied with the collaboration. He worked professionally, paid attention to detail, and contributed valuable ideas throughout the process. I can highly recommend him.",
      "img_src": "daniel_yeoh.png"
    },
    {
      "id": 2,
      "name": "Edwina Sun",
      "title": "Project Manager",
      "testimonial": "From day one, the execution was tight and timelines were respected. Our site looks and feels premium, and feedback has been all fire.",
      "img_src": "edwina_sun.jpg"
    }
  ]
}
