{
  "services": [
    {
      "id": 1,
      "title": "modern design",
      "description": "Your website will look stunning and function perfectly on any device - desktop, tablet, or mobile. No outdated designs, just sleek, modern, and user-friendly experiences."
    },
    {
      "id": 2,
      "title": "comprehensive",
      "description": "What's the point of a website if no one finds it? We build websites with SEO best practices to help you rank on Google and attract organic traffic."
    },
    {
      "id": 3,
      "title": "support & maintenance",
      "description": "A website needs updates, security checks, and tweaks to stay relevant. We offer post-launch support, troubleshooting, and maintenance so you never have to worry."
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Napparaten",
      "description": "A responsive website for a Stockholm-based naprapathy clinic. Designed to highlight services, build trust and simplify appointment bookings.",
      "img_alt": "Homepage of Napparaten, a Stockholm naprapathy clinic, with clean layout, calming visuals and a prominent call-to-action to book an appointment",
      "img_src": "napparaten.png",
      "external_link": "https://napparaten.se/",
      "techs": ["wordpress"]
    },
    {
      "id": 2,
      "title": "Jon Raynor PT",
      "description": "A modern site for a personal trainer, built to showcase training programs and client results. Focused on clarity, motivation and conversion.",
      "img_alt": "Homepage of personal trainer Jon Raynor, featuring bold fitness imagery, a motivational headline and links to training services.",
      "img_src": "pt_jonraynor.png",
      "external_link": "https://rylandermedia.wixstudio.com/personal-trainer",
      "techs": ["wix studio"]
    }
  ],
  "testimonials": [
    {
      "id": 1,
      "firstName": "Daniel",
      "lastName": "Yeoh",
      "title": "Dr. of Naprapathy",
      "testimonial": "I hired Joe to build my website and was very satisfied with the collaboration. He worked professionally, paid attention to detail, and contributed valuable ideas throughout the process. I can highly recommend him.",
      "img_src": "daniel_yeoh.png"
    },
    {
      "id": 2,
      "firstName": "Edwina",
      "lastName": "Sun",
      "title": "Project Manager",
      "testimonial": "I had a great experience working with Joe. The project was delivered on time, and the communication throughout was clear and efficient. He made sure to include all the features I wanted without any hassle. I'm very happy with the final result and would definitely recommend his services.",
      "img_src": "edwina_sun.jpg"
    }
  ],
  "experienceItems": [
    {
      "id": 1,
      "startDate": "2023",
      "endDate": null,
      "company": "Odevo",
      "position": "Frontend Developer",
      "description": "Built and maintained an internal ERP SaaS platform for property and financial management • Developed a customer portal for handling errands, finances, and housing services • Created a website builder for housing associations • Worked closely with stakeholders to deliver clean, responsive, and user-focused features"
    },
    {
      "id": 2,
      "startDate": "2022",
      "endDate": "2022",
      "company": "TT News Agency",
      "position": "Fullstack Developer",
      "description": "Developed a full-stack web application for presenting and managing Swedish election data • Built a modern user interface with responsive design • Created a RESTful API with full CRUD functionality • Designed and maintained a scalable SQL database for reliable data storage"
    },
    {
      "id": 3,
      "startDate": "2021",
      "endDate": "2022",
      "company": "</salt>",
      "position": "Fullstack Developer",
      "description": "Graduated from a 3-month intensive JavaScript full-stack bootcamp • Immediately hired as a consultant upon completion • Specialized in modern web development technologies and methodologies"
    },
    {
      "id": 4,
      "startDate": "2025",
      "endDate": "present",
      "company": "Self-employed",
      "position": "Freelance Web Designer & Developer",
      "description": "Designed and developed custom websites for clients across industries including tech, wellness, and finance • Improved website load times by up to 40% through performance optimization and code refactoring • Delivered fully responsive, mobile-first designs ensuring consistent UX on all devices • Collaborated remotely with international clients using agile and async workflows"
    }
  ]
}
